<?php
/**
 * ---------------------------------------------------------------------------------
 * @filename
 *     @chinese: 项目扩展管理模型类
 *     @english: TravelModel.class.php
 *
 * @version: 1.0
 * @desc   : 项目扩展逻辑实现
 *
 * @author : Zhang XiaoFei (1326336909@qq.com)
 * @date   : 2016-03-24 16:58:32
 */
class ItemExtendModel extends CommonModel
{
  private $table = 'item_extend'; # 项目扩展信息表

  /**
   * --------------------------------------------------------------------------------------
   * 项目模型数据验证
   */
  protected $_validate = array();


  /**
   * --------------------------------------------------------------------------------------
   * 项目模型自动完成
   */
  protected $_auto = array();


   /**
   * --------------------------------------------------------------------------------------
   * 初始化数据表信息
   */
  public function __construct()
  {
    parent::__construct($this->table);
  }


# + ----------------------------------------------------------------------------------------------
# + 逻辑

  /**
   * --------------------------------------------------------------------------------------
   * 保存表单提交数据
   */
  public function doSaveFromDataAction($info)
  {
    $result = $this->doAddAllTableAction($info);

    return $result;
  }
}
